In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

# How to handle missing datas in ds using pandas

In [ ]:
#Consider utility fns.
#in panda u can use isnull/isna for findinf mising data

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isna(np.nan)

True

In [4]:
# The opposite ones also exist like not null

pd.notnull(np.nan)

False

In [5]:
# The opposite ones also exist like notna

pd.notna(np.nan)

False

In [6]:
pd.notnull(3)

True

In [7]:
# These fns also work with Series and DataFrames

In [8]:
#Series

pd.Series([1,np.nan,7])

0    1.0
1    NaN
2    7.0
dtype: float64

In [9]:
pd.isnull(pd.Series([1,np.nan,7]))

0    False
1     True
2    False
dtype: bool

In [10]:
#over a data frame

#create a DataFrame
d=pd.DataFrame({
    'Column A':[1,np.nan,7],
    'Column B':[np.nan,2,3],
    'Column C':[np.nan,2,np.nan],
   
})
d

   Column A  Column B  Column C
0       1.0       NaN       NaN
1       NaN       2.0       2.0
2       7.0       3.0       NaN

In [11]:
pd.isnull(d)

#where ever null is there it will show as true.

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

# Pandas Operations with Missing Values

In [12]:
#Pandas manages Missing Values much gracefully than Numpy

In [13]:
pd.Series([1,2,np.nan])

0    1.0
1    2.0
2    NaN
dtype: float64

In [14]:
#Counting the number of values that is inside the []
pd.Series([1,2,np.nan]).count()

2

In [15]:
#Counting the number of values that is inside the []
pd.Series([1,2,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,444,np.nan]).count()

3

In [16]:
#Sum of the number of values that is inside the []
pd.Series([1,2,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,444,np.nan]).sum()

447.0

In [17]:
#Mean (Avg) of the number of values that is inside the []
pd.Series([1,2,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,444,np.nan]).mean()

149.0

In [18]:
#Numpy doesnt treat these nan value properly
np.array([1,2,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,444,np.nan]).mean()

nan

## Filtering of the missing data

In [19]:
#It very easily works with filtering

s = pd.Series([1,2,3,np.nan,np.nan,4])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [20]:
#not null fun

pd.notnull(s)
#where ther is Nan it will give as False
#where ever there is a value then it will shoe as True

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [21]:
s[pd.notnull(s)]
#filtering out NaN values

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [22]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [23]:
s[pd.isnull(s)]
#it willl filter only the NaN values

3   NaN
4   NaN
dtype: float64

# Dropping Null Values

In [24]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [25]:
s.dropna()
#dropping nan values

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

# Dropping Null values on Data Frame

In [29]:
#Create DF

df = pd.DataFrame({
    'Column A':[1,np.nan,30,np.nan],
    'Column B':[2,8,31,np.nan],
    'Column C':[np.nan,9,32,100],
   'Column D':[5,8,34,110]
})
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [30]:
df.shape

(4, 4)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [32]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [34]:
df.isnull()
#NaN values = True

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [35]:
df.isna()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [36]:
#How many Null values are there in a column
df.isna().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [38]:
#Default behaviour of dropping Na (dropna) will drop all rows which any null value is present

df.dropna()
#it will drop all the columns in which NaN values are there

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [39]:
#u can also controll it by using axis values

df.dropna(axis=0) #columns

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [40]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [41]:
#u can also controll it by using axis values

df.dropna(axis=1) #rows

   Column D
0         5
1         8
2        34
3       110

In [42]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [43]:
df.dropna(axis='columns')

   Column D
0         5
1         8
2        34
3       110

In [44]:
df.dropna(axis='rows')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [46]:
# Create a DF to show the behaviour of 2 parameters 
df2 = pd.DataFrame({
    'Column A':[1,np.nan,30],
    'Column B':[2,np.nan,31],
    'Column C':[np.nan,np.nan,100],
})
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [49]:
df2.dropna(how = 'all')
#it checks row wise if all the values NaN so dont drop it if no.
#if all the values in a row ar nan then drop it

   Column A  Column B  Column C
0       1.0       2.0       NaN
2      30.0      31.0     100.0

In [50]:
df2.dropna(how='any') #default behaviour

   Column A  Column B  Column C
2      30.0      31.0     100.0

In [ ]:
#default behaviour
# how='any', inplace =False, thresh = none

In [51]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [54]:
#Threshold parameter
df.dropna(thresh=3)

#means it check the number of the null values should be less than or = 3
#it will keep that row if it is = 3 non null values

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [55]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [57]:
df.dropna(thresh=3, axis='columns')
#checks column wise if column has = 3 null values then drop

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

# FILLING OF NULL VALUES

In [58]:
#depends on context and data set you are working with.
#u can take 0 , means, highest values and substitute in place of nan

In [59]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

__Filling nulls with a arbitary value__

In [60]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [61]:
#cal mean
s.mean()

2.5

In [62]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [63]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

__Filling nulls with contigious (closed) values__

In [65]:
s.fillna(method = 'ffill')
#ffill- forward fill - top to bottom

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [66]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [69]:
s.fillna(method = 'bfill')
#bfill - backward fill - bottom to top

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

__This can still leave null values at the extremes of the series or data frame__

In [70]:
x = pd.Series([np.nan, 3 , np.nan,9])
x

0    NaN
1    3.0
2    NaN
3    9.0
dtype: float64

In [71]:
x.fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [75]:
x = pd.Series([np.nan, 3,4,5,6,7,2 , np.nan,9,np.nan,22,33,np.nan])
x

0      NaN
1      3.0
2      4.0
3      5.0
4      6.0
5      7.0
6      2.0
7      NaN
8      9.0
9      NaN
10    22.0
11    33.0
12     NaN
dtype: float64

In [76]:
#top to bottom ... line 6... 2 will fill nan as 2 ... line 8 ... 9 will fill nan as 9 ...line 11 ... 33.0 will fill  the nan value as 33
#then again from bottom to top it will check if any nan value is there or not and fill the nan value with the previous value
x.fillna(method='ffill').fillna(method='bfill')

#this works in 2 steps
#first forward fill happen and with the result then the backward fill will happen

0      3.0
1      3.0
2      4.0
3      5.0
4      6.0
5      7.0
6      2.0
7      2.0
8      9.0
9      9.0
10    22.0
11    33.0
12    33.0
dtype: float64

__Filling null values on DataFrame__

In [77]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

#Problem statement:

Lets Fill missing values in Column A with 0.

Lets Fill missing values in Column B with 99.

Lets Fill missing values in Column C with mean.

In [79]:
#({}) use as dictionary
df.fillna({
    'Column A' : 0,
    'Column B' : 99,
    'Column C' : df['Column C'].mean(),
    #as in Column C there is space so use df['Column C']
})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [80]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [81]:
df.fillna(method='ffill')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [82]:
#or
df.fillna(method='ffill',axis = 0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [83]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [86]:
df.fillna(method='ffill',axis = 1)
#row wise
#1 -> 2 ->nan->5
#1 ->2 ->2->5

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

In [88]:
df.fillna(method='bfill',axis = 1)
#nan<-nan<-100<-100
#100<-100<-100<-100

#or

#nan<-8<-9<-8
#8<-8<-9<-8

   Column A  Column B  Column C  Column D
0       1.0       2.0       5.0       5.0
1       8.0       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3     100.0     100.0     100.0     110.0

In [91]:
#in case

df.fillna({
    'Column A' : 0,
    'Column B' : df['Column B'] .fillna(method='ffill'),
    'Column C' : df['Column C'].mean(),
    #as in Column C there is space so use df['Column C']
})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      31.0     100.0       110

# Cleaning not-null values from the data

In [94]:
#corrupt values will also be present
#errors in values
df = pd.DataFrame({
    'Sex' : ['M','F','F','D','?'],
    'Age' : [29,30,24,290,25]
    
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [95]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [96]:
df['Sex'].value_counts()

F    2
D    1
?    1
M    1
Name: Sex, dtype: int64

In [98]:
df['Sex'] = df['Sex'].replace('D','F')
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F  290
4   ?   25

In [99]:
df = pd.DataFrame({
    'Sex' : ['M','F','F','D','?'],
    'Age' : [29,30,24,290,25]
    
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [101]:
#Multiple changes
df['Sex'] = df['Sex'].replace({
    'D' : 'F',
    'N' : 'N'
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F  290
4   ?   25

In [102]:
df = pd.DataFrame({
    'Sex' : ['M','F','F','D','?'],
    'Age' : [29,30,24,290,25]
    
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

__If you have many columns to replace, you could apply it as a DataFrame level as well__

In [103]:
#Cleaning data frame
df.replace({
    'Sex':{ 'D':'F','N':'M'},
    'Age':{ 290:29}
    
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [104]:
#another way to clean df
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [105]:
df['Age']>100

0    False
1    False
2    False
3     True
4    False
Name: Age, dtype: bool

In [106]:
df[df['Age']>100]

  Sex  Age
3   D  290

In [107]:
# if age is greater than 100 in such case divide by 10

df.loc[df['Age']>100, 'Age'] = df.loc[df['Age']>100, 'Age']/10
df

  Sex   Age
0   M  29.0
1   F  30.0
2   F  24.0
3   D  29.0
4   ?  25.0

In [108]:
df = pd.DataFrame({
    'Sex' : ['M','F','F','D','?'],
    'Age' : [29,30,24,290,25]
    
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [109]:
#Using lambda function

def age_clean(x):
    if x>100:
        return x/10
    else:
        return x

In [110]:
df['Age'] = df['Age'].apply(age_clean)
df

  Sex   Age
0   M  29.0
1   F  30.0
2   F  24.0
3   D  29.0
4   ?  25.0

# Duplicates

In [111]:
#how to handle duplicates

ambassadors = pd.Series([
    'France',
    'United kingdom',
    'United kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index = [
    'Gerard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth'
])
ambassadors

Gerard Araud                  France
Kim Darroch           United kingdom
Peter Westmacott      United kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object


__For dealing with duplicates there are 2 impt methods:__
    
    > duplicated: it tells u which values are duplicates
        
    > drop_duplicates: helps get rid of duplicates

In [112]:
ambassadors.duplicated()

Gerard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [113]:
#how many values are duplicated
ambassadors.duplicated().sum()

3

__Observation__ it went from top to bottom ....

Gerard Araud                  France - unique

Kim Darroch           United kingdom - unique

Peter Westmacott      United kingdom - duplicate

Armando Varricchio             Italy - unique

Peter Wittig                 Germany - unique

Peter Ammon                  Germany - duplicate

Klaus Scharioth              Germany - duplicate

In [115]:
ambassadors.duplicated(keep='last')
#from bottom to top

Gerard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [116]:
ambassadors

Gerard Araud                  France
Kim Darroch           United kingdom
Peter Westmacott      United kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [119]:
ambassadors.duplicated(keep=False)
#duplicates are true

Gerard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [120]:
#Removing the duplicates

ambassadors

Gerard Araud                  France
Kim Darroch           United kingdom
Peter Westmacott      United kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [122]:
ambassadors.drop_duplicates()
#duplicates are removed

Gerard Araud                  France
Kim Darroch           United kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [123]:
ambassadors

Gerard Araud                  France
Kim Darroch           United kingdom
Peter Westmacott      United kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [124]:
ambassadors.drop_duplicates(keep = 'last')
#it will check from last and then keep the unique values and remove duplicates

Gerard Araud                  France
Peter Westmacott      United kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [125]:
ambassadors.drop_duplicates(keep = False)
#no duplicates at all

Gerard Araud          France
Armando Varricchio     Italy
dtype: object

__Duplicates in DataFrames__

In [126]:
players = pd.DataFrame({
    'Name' : [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos' : [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [128]:
players.duplicated()
# only Kobe Bryant SG is duplicated

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [129]:
players.duplicated().sum()

1

__Conceptually, "duplicated " means all the column values are duplicates.
We can customize this with the subset parameters.__

In [131]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [132]:
players.duplicated(subset=['Name'])
#only if name is duplicated

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [133]:
players.duplicated(subset=['Name'],keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [134]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [135]:

#Drop duplicates
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [136]:
players.drop_duplicates(subset=['Name'])
#if any name is repeating then remove it

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF

In [138]:
players.drop_duplicates(subset=['Name'], keep='last')
#checks from bottom to top

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF